package resources;

/**
 * Created by javadev on 17.03.14.
 */
public class Additional_lections_info {
    public static String core_tkach =
            "=====================================================\n"+
            "Мини-курс «Core Java»\n"+
            "(Первые 2 лекции состоят в базовом списке обучающей программы)\n"+
            "Курс учит базовому программированию на языке Java, \n" +
            "объясняет основные понятия, знакомит с наиболее популярными \n" +
            "библиотеками и средствами, которые могут пригодиться тестировщикам. \n" +
            "Курс расчитан на слушателей, которые слабо подготовлены в программировании.\n"+
                    "=====================================================\n";
    public static String advanced_generics_tkach =
            "=====================================================\n"+
            "Мини-курс «Advanced Java — Generics» подробно рассматривает \n" +
            "скрытые проблемы, возникающие при игнорировании женериков,\n" +
            " объясняет особенности наследования при использовании\n" +
            " классов с обобщенной типизацией, а также показывает, как повысить \n" +
            "эффективность кода с применением метасимволов (wildcard) и\n" +
            " расширителей обобщения (extends и super).\n"+
    "=====================================================\n";
    public static String advanced_concurency_tkach =
            "=====================================================\n"+
            "Мини-курс «Advanced Java — Concurrency» знакомит со сложными концепциями \n" +
            "многопоточности и параллелизма в языке Java на основе пакета\n" +
            "java.util.concurrent. В нем кратко вспоминаются основные механизмы \n" +
            "синхронизации в Java, одновременно представляются общие проблемы, \n" +
            "связанные с использованием потоков (например, возникновение deadlock)\n " +
            "Показываются эффективные способы их решения. Курс знакомит с \n" +
            "высокоуровневыми методами синхронизации с использованием CountDownLatch,\n" +
            "CyclicBarrier, ThreadLocal, а также Executors для запуска потоков.\n" +
            "В данном курcе активно применяется кодировние программ слушателями,\n" +
            "что позволяет наработать практические навыки использования потоков в Java.\n"+
    "=====================================================\n";
    public static String  advanced_coll_tkach =
            "=====================================================\n"+
            "Мини-курс «Advanced Java — Collections» посвящен детальному рассмотрению \n" +
            "стандартных реализаций интерфейсов Java Collections Framework \n" +
            "(hash maps, queues, sets), объясняет их особенности, способы применения \n" +
            "Знакомит с некоторыми интересными свойствами, позволяющими повысить \n" +
            "эффективность работы с коллекциями в программе, а также избежать \n" +
            "возникновения скрытых багов. Вторая часть данного мини-курса знакомит с \n" +
            "неблокирующими реализациями коллекций  объясняет разницу между\n" +
            " ними, а также на практике показывает их плюсы и минусы, \n" +
            "и возможное применение.\n"+
            "=====================================================\n";
    public static String other_kornev =
            "=====================================================\n"+
            "Автор Корнеев Георгий Александрович.\n" +
            "Введение в Java\n" +
            "Введение в ООП на Java (1)\n" +
            "Введение в ООП на Java (2)\n" +
            "Обработка ошибок и исключения\n" +
            "Синтаксис Java\n" +
            "Ввод-вывод\n" +
            "Collections Framework\n" +
            "Новые возможности Java 5\n" +
            "Reflection\n" +
            "Введение в многопоточное программирование\n" +
            "Задачи и средства многопоточного программирования\n"+
            "=====================================================\n";

}
