package resources;

/**
 * Created by javadev on 08.03.14.
 */
public class Lections_Info {
    public static String core_txt =  "Ресурс - www.golovachcourses.com \n" +
            "=================================== \n" +
            "\n"+
            "Part-1: Циклы(for, while, вложенные) \n" +
            "Part-2: Рекурсия в Java \n" +
            "Part-3: Динамические структуры данных \n" +
            "Part-4: Память в Java и работа JVM \n"+
            "\n"+
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n"+
            "=================================== \n"+
            "                                      ";
    public static String intro_txt =  "Часть - 1\n" +
            "Введение в язык Java\n" +
            "=================================== \n" +
            "Часть - 2 \n" +
            "Синтаксис языка Java\n"+
            "=================================== \n" +
            "Курс подходит как для тестеровшиков\n"+
            "так и для разработчиков Java\n"+
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n";

    public static String exception_txt =
            "Ресурс - www.golovachcourses.com \n" +
            "=================================== \n" +
            "Исключения в Java: \n" +
            "=================================== \n" +
            "Базовая иерархия \n" +
            "(Throwable, Error, Exception, RuntimeException)\n" +
            "checked/unchecked исключения, stack trace\n" +
            "Обработка исключений \n" +
            "(try, catch, finally, throw, throws),\n" +
            "Методы работы с исключениями в проектах).\n"+
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n";

    public static String collections_txt =
            "Ресурс - www.golovachcourses.com \n" +
            "=================================== \n" +
            "Коллекции в Java: \n" +
            "=================================== \n" +
            "Архитектура пакета коллекций: \n" +
            "(Collection, List, Set, Map, SortedSet, \n" +
            "SortedMap, Iterable, Iterator, \n" +
                    "Comparable, Comparator)\n" +
            "Основные реализации и их внутреннее устройство\n" +
            "(ArrayList, LinkedList, HashMap, \n" +
                    "TreeMap, HashSet, TreeSet)\n" +
            "«Устаревшие коллекции» (Vector, Stack, \n" +
                    "Hashtable, Enumeration).\n"+
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n";

    public static String  multy_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
            "Потоки в Java:\n" +
            "=================================== \n" +
            "Thread, Runnable, synchronized, volatile, \n" +
                    "wait()/notify()/notifyAll()\n" +
            "Все те механизмы, которые позволяют создавать \n" +
                    " многопоточные программы\n" +
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";

    public static String oop_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
            "Объектно-ориентированная Java:\n" +
            "=================================== \n" +
            "Классы, интерфейсы, наследование, \n" +
                    "полиморфизм, инкапсуляция\n" +
            "Области видимости, переопределение\n" +
            "Все то, что делает Java ООП языком.\n" +
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n"+
            "=================================== \n"+
            "                                      ";

    public static String summary_txt =
            "Ресурс - www.golovachcourses.com \n" +
            "========================== \n" +
            "Итоговая лекция\n" +
            "========================== \n";


    public static String io_txt =
            "Ресурс - www.golovachcourses.com \n" +
            "=================================== \n" +
            " Java I/O:\n" +
            "=================================== \n" +
            "Механизмы Java ориентированные на работу \n" +
                    "с потоками ввода/вывода \n" +
            "(InputStream/OutputStream, Reader/Writer, \n" +
                    "DataInput/DataOutput, ...etc)\n" +
            "Классы-адаптеры (InputStreamReader, ...)\n" +
            "Классы-декораторы (BufferedWriter, ...)\n" +
            "Работа с файлами, сериализация.\n"+
            "=================================== \n" +
            "Совет! # Если Вам что-то не понятно,\n"+
            "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
    public static String diloc_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "========================== \n" +
                    "IoC, DI, IoC-контейнер \n" +
                    "========================== \n";
    public static String http_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n"+
                    "HTTP\n" +
                    "txttxttxttxt\n" +
                    "txttxttxttxt\n" +
                    "txttxttxttxt\n" +
                    "txttxttxttxt\n" +
                    "=================================== \n";
    public static String jdbc_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n"+
                    "Работа с реляционной БД: \n" +
                    "=================================== \n"+
                    "Язык SQL\n" +
                    "Библиотека JDBC\n" +
                    "Реляционная база данных MySQL\n" +
                    "Шаблон DAO.\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
    public static String maven_log4u_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n"+
                    "Инструменты enterprise-разработки:  \n" +
                    "=================================== \n"+
                    "Библиотека логирования (Log4j)\n" +
                    "Инструмент сборки проекта (Maven)\n" +
                    "Система контроля версий (SVN)\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
    public static String patterns_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
                    "Шаблоны проектирования: \n" +
                    "=================================== \n" +
                    "10 наиболее популярных шаблонов GoF:\n" +
                    "Builder, Singleton, Prototype\n" +
                    "Factory Method, Adapter, Decorator\n" +
                    "Command, Iterator, Strategy, Template Method\n" +
                    "Шаблоны GoF в JDK.\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
    public static String rest_mvc_spring_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
                    "txttxttxttxtxt: \n" +
                    "=================================== \n" +
                    "txttxttxttxtxt\n" +
                    "txttxttxttxtxt\n" +
                    "txttxttxttxtxt\n" +
                    "txttxttxttxtxt\n" +
                    "txttxttxttxtxt\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
    public static String servlet_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
                    "Servlets API / JSP: \n" +
                    "=================================== \n" +
                    "Servlet API/JSP\n" +
                    "i18n/l10n + components\n" +
                    "Публичный разбор web-проекта\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";

    public static String tdd_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
                    " Test-driven development, TDD: \n" +
                    "=================================== \n" +
                    "Part 1 - JUnit\n" +
                    "Part 2 - Mockito\n" +
                    "Part 3 - TDD\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
    public static String xml_generics_txt =
            "Ресурс - www.golovachcourses.com \n" +
                    "=================================== \n" +
                    "Part 1 - XML\n" +
                    "Part 2 - Generics\n" +
                    "=================================== \n" +
                    "Совет! # Если Вам что-то не понятно,\n"+
                    "ищите ответы в книгах.\n"+
                    "=================================== \n"+
                    "                                      ";
}
